# CannotSetFamilyTypeToNone Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotSetFamilyTypeToNone Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Cannot set Family Type to 'None';.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSetFamilyTypeToNone { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSetFamilyTypeToNone As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSetFamilyTypeToNone {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace